In [16]:
import pandas as pd

## Birebir Birleştirme

In [24]:
df1=pd.DataFrame({
    "calisanlar":["Ali","Veli","Ayse","Fatma"],
    "grup":[ "Muhasebe", "Muhendislik", "Muhendislik","IK"]
})

df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [25]:
df2=pd.DataFrame({
    "calisanlar":["Ali","Veli","Ayse","Fatma"],
    "ilk_giris":["2010","2009","2014","2019"]
})

df2

  calisanlar ilk_giris
0        Ali      2010
1       Veli      2009
2       Ayse      2014
3      Fatma      2019

In [26]:
pd.merge(df1, df2) # Birebir Birleştirme
# iki veri setinde de çalışanlar olduğu için bunu çalışanlara göre birleştirdi.

  calisanlar         grup ilk_giris
0        Ali     Muhasebe      2010
1       Veli  Muhendislik      2009
2       Ayse  Muhendislik      2014
3      Fatma           IK      2019

In [27]:
# neye göre birleştireceğimizi belirtmek istersek
pd.merge(df1,df2, on="calisanlar")

  calisanlar         grup ilk_giris
0        Ali     Muhasebe      2010
1       Veli  Muhendislik      2009
2       Ayse  Muhendislik      2014
3      Fatma           IK      2019

## Çoktan Teke: Many to One

In [28]:
df3=pd.merge(df1,df2)
df3

  calisanlar         grup ilk_giris
0        Ali     Muhasebe      2010
1       Veli  Muhendislik      2009
2       Ayse  Muhendislik      2014
3      Fatma           IK      2019

In [29]:
df4=pd.DataFrame({
    "grup":["Muhasebe","Muhendislik","İK"],
    "mudur":["Caner","Mustafa","Berkcan"]
})

df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           İK  Berkcan

In [30]:
# çoktan teke(many to one): çoklama yapıyla tekil yapının birleştirme işlemidir.
pd.merge(df3,df4)
# ortak değişken grup olduğundan ona göre birleştirilir

  calisanlar         grup ilk_giris    mudur
0        Ali     Muhasebe      2010    Caner
1       Veli  Muhendislik      2009  Mustafa
2       Ayse  Muhendislik      2014  Mustafa

- df4: grup 3 tane değerden oluşuyor. tekil bir yapı var
- df3: grup 4 tane değerden oluşuyor. çoklu bir yapı var
- bu ikisini bir araya getirdiğimizde mudur'ler gruba göre birleştirild.

## Çoktan Çoğa: Many to Many

In [31]:
df5=pd.DataFrame({
    "grup":["Muhasebe","Muhasebe","Muhendislik","Muhendislik","İK","İK"],
    "yetenekler":["matematik","excel","kodlama","linux","excel","yonetim"]
})

df5
# her grubun birden çok yeteneği olduğu görülür: çoklu bir yapı

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           İK      excel
5           İK    yonetim

In [32]:
df1 # tekil

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [33]:
pd.merge(df1,df5) # Ali'nin birden fazla yeteneği olduğu görülür: çokladı.
# her çalışanın birden fazla yeteneği olduğu görülür

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Muhendislik    kodlama
3       Veli  Muhendislik      linux
4       Ayse  Muhendislik    kodlama
5       Ayse  Muhendislik      linux